{
  "capstoneProject": [
    {
      "id": "1",
      "name": "Traveler’s VR",
      "groupMembers": ["Phison Khankhang", "Chatchanok Wongsamang"],
      "abstract": "This project was designed to create a travel experience for the elderly, who love to travel, but may not have enough energy or time to travel long distances, or have no friends or caretakers on the trips. We created “TRAVELER’S VR” as a virtual reality game, that simulates tourist attractions, especially temples. Main features of this project cover donation to the temple and fortune prediction by Esiimsi. Players can walk around the map to see the beautiful surroundings and architecture of the temple and go inside to participate in some activities in the game. They also can experience realistic donations by topping up money to the system. A payment system in the web application was the Omise payment gateway. After topping up money, a player can grab the coin and drop it to the donation box then the system will decrease the value of the coin 10 baht.",
      "background": "",
      "objective": "The purpose of this thesis is to provide tourism experiences for the elderly through VR technology. This project aimed to build the most realistic tourist attraction, which is the temple in this project, and activities in the temple. The developers chose the activities base on the questionnaire; The Traveling Behavior of the Elderly. All activities cover paying respect to buddha statues, donating, and Esiimsi for fortune-telling. The key objective is to make the elderly get the most comfortable and realistic experience from their own travel experiences at home.",
      "linkYT": "https://youtu.be/RVu5GtbfrXU",
      "linkGit": "https://github.com/phisonk/Traveler-s-VR-temple",
      "academic year": "2020",
      "img":""
    },
    {
      "id": "2",
      "name": "ARNutrition Project",
      "groupMembers": ["Jirayu Promsongwong", "Nattamon Sridam"],
      "abstract": "The purpose of this project is to study and explore the issues that restaurants have in displaying nutritional values on menus, in order to find pain points and customer insight to solve the problems or obstacles that prevent its execution and develop a mobile application that meets the needs of restaurant and customers. The needs of the restaurant is to capture a wider customer base by adding nutritional values on the menu so that customers can make healthy food choices and earn more revenue. However, it may affect some customers negatively, namely those who just want to enjoy their food without thinking about its nutritional values. Having nutritional values displayed may stop them from enjoying their food. This project considers the issues of how to allow people who want to know the nutritional values of food access it on the menu without stopping people who strongly disagree with receiving this information and want to just enjoy their food. Additionally, this project seeks to assist restaurant owners to display nutritional values with less problems and help them to add nutritional values of unlabeled food product.",
      "background": "In Thailand, customers are increasingly concerned about their health and wellness. The report on health and wellness in the country found that consumers have become aware of the importance of health and wellness. In order to stay healthy, customers choose healthier food or beverages instead of exercise, a trend which has not changed for more than three years. Additionally, the report claims that high nutritional values have become the main deciding factor when consumers buy healthy food and beverages. As for the trend of displaying nutritional values on restaurant menus, there are numerous articles discussing this. The article argues that this will be a new trend adopted as soon as possible by restaurants in order to reach a wider customer base. For customers who are concerned with the nutrition or calories of food, displaying nutritional values will satisfy their needs.",
      "objective": "AR Nutrition is a mobile application that was developed by using the Unity real-time development platform and Vuforia Engine. The AR Nutrition Application is an intermediary between consumers (healthy people) and shop owners. This project was created by studying and exploring the trends of the market, both in Thailand and around the world. Based on the above statistics as mentioned in previous chapters, the healthy trend is gaining a lot of attention among people aged 18 and above, which is considered to be a very wide customer base.",
      "linkYT": "https://youtu.be/Pq-XT5LMfTg",
      "linkGit": "https://github.com/fernvnat14/AR-QR-Project",
      "Academic year": "2020",
      "img":""
    },
    {
      "id": "3",
      "name": "ParkIn",
      "groupMembers": ["Jiramate Leingprom", "Thirawat Rungrojchaiyaporn"],
      "abstract": "An automobile is a one of vehicles that most people use to travel around; for example, going to work, traveling, going on errands, etc. When people go on their errands, they have to park their cars close to those places. Thus, parking by a roadside is the best choice for parking their cars; furthermore, it is not easy to find a parking space which can lead to traffic congestion. This research introduces the mobile application searching and learning the problems of those who have no idea to find a parking lot which causes a big problem in nowadays. Based on these problems, the “ParkIN” application platform for the driver. This mobile application composes of 3 main features which are Driver ID and Reservation System, History of Parking System and Payment via PayPal Smart Buttons. This research will focus on “ParkIN Mobile Application”. The system is the application that can reservation the parking lot by the users who have no idea where to park. This system can pay after the user makes a reservation and the price will be calculated by duration of the start reservation time and end time. Moreover, the user can see the history of the parking, categorize the time that the user wants to park which can be the date-from and date-to with the time duration. Lastly, the registration by our provider “Google with Firebase Authentication built-in”.",
      "background": "Nowadays there is undisciplined parking in busy commercial districts; for instance, parking by the roadside and parking in front of the store or the store area. Many districts try to solve this problem by making regulations that   the citizens can park only for a period of time; therefore, they must have a staff to check if someone breaks the rule. The stores by the roadside, they try to put something to block the parking lot such as traffic cones or chairs which is illegal and may cause the traffic jam. These problems make the drivers feel worried and awkward when they want to park near the roadside. Additionally, they have to drive around slowly for searching the parking lot, also it will cause traffic congestion.",
      "objective": "ParkIN is a mobile application that helps users find the parking lot at the roadside easier. This application can search for parking lot that users want, make a reservation and payment. Combines with parking meter to show status of the parking lot.",
      "link": "https://youtu.be/Kh8feXOMo8A",
      "linkGit": "https://github.com/aomramete/ParkinProject",
      "Academic year": "2020",
      "img":""
    },
    {
      "id": "4",
      "name": "Navigation Application for Indoor and Outdoor",
      "groupMembers": ["Kitpol Tansakul", "Peeranat Limpitaporn"],
      "abstract": "The objective of this study is to create an application that helps users navigate their way in both indoor and outdoor environment. This application was created for people who often lose their way in buildings or are not able to locate their destination. We focused on testing how users can navigate their way in an indoor environment at HM building located in the Faculty of Engineering Department of King Mongkut’s Institute of Technology Ladkrabang. The benefit of this study is to help users reach the right place in an efficient manner, saving the user both time and money that often goes in vain when navigating their ways around.",
      "background": "In 2019, the number of smartphones sold was estimated at 1.52 billion units. Additionally, the number is expected to increase to about 1.59 billion units in 2021, according to the statistic. Around 19% of worldwide population owns smartphones. Countless people have laid their hope on daily traveling to smartphone applications, such as Google maps and Apple map, since they are not only considered as a “helper” in keeping track of routes but are also a tool used to represent current traffic situation and recommend the fastest routes available. However, the problem is existing applications have yet to cover indoor spaces because GPS cannot access through walls nor hurdle through impediments in the building. In everyday life, a lot of people always go to newer places such as department stores, hospitals, schools, buildings, offices, universities, and large buildings. They tend to either lose their way or are unable to trace their destination owing to lack of information regarding the location. Thus, they end up spending more time finding and reaching the place. Although in some places there may already be maps attached near the information areas or paper maps given to customers. The place may be distant or complicated to understand. As a result, it creates difficulty for visitors who are not familiar or cannot easily find the place. These issues can be eliminated by using our application as the app is capable of detecting the user’s position, finding the user’s destination, and finally leading the user to the desired destination, for both indoor and outdoor environment.",
      "objective": "Navigation app is a mobile application that helps users navigate their way in both indoor and outdoor environment. Our application was developed to work on smartphones, specifically the android operating systems. The application can be categorized into 2 parts with respect to its system. The first part is navigating system in an ‘outdoor’ environment using the Google API. The second part is navigating system in an ‘indoor’ environment using Bluetooth which are generally integrated within smartphones and designed to have lower power consumption capability. The indoor navigation is designed with Bluetooth Low Energy (BLE) sensors called ‘beacon’ connecting to a smart phone application. ‘Beacon’ will be installed in various points, including the front area of the room, in the building. The application is able to detect the user’s position via the closest beacon. The system will recognize the user’s position and navigate to the destination.",
      "linkYT": "https://youtu.be/RI09zpmIhww",
      "linkGit": "https://github.com/kitspon/project_beacon",
      "Academic year": "2020",
      "img":""
    },
    {
      "id": "5",
      "name": "TinyEpicBrains: VideoQR",
      "groupMembers": [
        "Napatee Kanchanawilas",
        "Tanapat Ruengrongratana",
        "Woraphot Khamthabthim"
      ],
      "abstract": "Nowadays we are all influenced by “advertising”, a cost-effective and efficient marketing approach to products, services, and ideas. The goal of this project was to create a web platform for businesses to advertise their business. We created a website for product distributors called “VideoQR” that allows them to insert videos with a hidden QR code that satisfies customer needs, especially useful is the “Embedded” feature. Among the main features of the project is the ability to attach product links to videos with user-friendly functions. Video advertising accounts for more than 80% of all advertising spending. Neither direct nor slanted promotional videos can persuade potential customers to buy. But it also says nothing more about the customers. VideoQR can drive customers to your chosen destination while our analytics solution gathers customer insights and delivers them to the business. VideoQR produces next-generation videos that push the boundaries of advertising.",
      "background": "For decades, advertising has been the most popular means of disseminating information about any product around the world. In Thailand, online and television advertisements are the most widely used advertising media. According to a survey conducted by National Broadcasting and Telecommunications Commission (NBTC), the survey also revealed some important points to consider among Thai media consumers. Consumer behavior in terms of how they acquire information differs by age. Older people aged 57 and older are more likely to obtain information through traditional media and read newspapers, while people aged 41 and younger are more likely to use content from a variety of media, especially online media. The actions of people aged 43 to 56 are often a mixture of the first and second groups mentioned. The majority of people do not have certain programs in mind, which indicates that they are not faithful to their broadcasts. People with more money trust advertising from online media more than media from TV, which gives them access to landlines in every home. Consumers have started reading digital media instead of newspapers, which has led to an upheaval in the newspaper industry.",
      "objective": "VideoQR provides products advertised via video on a screen. The goal of this project was to provide an advertising experience to the product owner via a hidden QR code in the video, as well as develop user roles. We create user experiences that are tailored to the needs of our clients. The embedding feature, user login, user management, and enterprise management are all features of the VideoQR web application that enhance the performance of the web application",
      "linkYT": "",
      "linkGit": "https://github.com/npmekk/VideoQR",
      "Academic year": "2021",
      "img":""
    },
    {
      "id": "6",
      "name": "Cyber Security Assessment Automated System",
      "groupMembers": [
        "Pawee Tantivasdakarn",
        "Nattha Siriboon",
        "Soponpakorn Suttikao"
      ],
      "abstract": "Security hygiene is important, especially within the finance industry, as user privacy is a major priority for financial services. To ensure the highest levels of cybersecurity, security tests must be carried out regularly. Under normal conditions, security testing is carried out by humans. As such, it is time-consuming, costly, and difficult to carry out on a regular and frequent basis. The aim of this project is to combat these problems using machines to run the process automatically, allowing assessment to be undertaken more frequently. The system developed, Cyber Security Assessment Automated System (CSAAS), can run security tests at all hours of the day, making use of a black-box network vulnerability assessment technique and various open-source tools (Hydra, DIRB, Nmap, SQLmap, Amass, Searchsploit, and XSSsniper). A broker company should provide the endpoints for running security tests. After which the system will run all necessary tests, generating a report to send back to the broker company. This report includes general information (such as IP address, port, and OS) as well as the vulnerabilities of the given endpoints.",
      "background": "Application of best practices, and proper configuration of the broker system are necessary in order to effectively prevent cyber-attacks. The most important matter to be considered is the hiring of a specialized company able to perform regular and effective security testing for the system. Nevertheless, as this can be expensive and time-consuming, it is hard for many companies to hire and maintain their system using a security testing service. The consequent lack of maintenance could lead to various security vulnerabilities.",
      "objective": "An alternative to security testing is network scanning. Scanning via the internet is not a highly complex scanning test option, when compared with a security test. On the contrary, it provides businesses with the convenience to scan regularly. Additionally, it can show the difference between the system hygiene of each scan. The aim of CSAAS is to provide an automated vulnerabilities assessment service which meets the following 2 objectives: 1.The service can be run automatically with endpoints provided by the broker company. 2.The broker company can access reports for any new scan as well as previous records for the purpose of auditing and improvement of the broker’s system.",
      "linkYT": "",
      "linkGit": "",
      "Academic year": "2021",
      "img":""
    },
    {
      "id": "7",
      "name": "CIEON Inventory Management System",
      "groupMembers": [
        "Krittatee Thongsiriprapa",
        "Jilaporn Pukasemvarangkool",
        "Rapichat Sitthiworrant"
      ],
      "abstract": "The goal of this research project is to develop a tool to reduce inventory management issues especially missing items by assisting companies with stock management, missing items, items and users’ summaries, and item tracking status. The CIEON Inventory Management System is an add-on solution that helps to increase product security. Using the CIEON Inventory Management System website’s functions to operate the lockers improves the system in terms of self-borrowing and self-returning. This project has two aspects: software and hardware. Log in, borrow, return, reservation, extend, broken, lost, and enter OTP are the eight main features of the software part. Student, teacher, and admin are the three users of this system: each with different limitations of website usage. Students get access to the eight main features as teachers, except the time constraint and object amount. Admins have four main functions: edit, view, add, and delete. The hardware part detects the items by using RFID readers and RFID tags. PHP, HTML, and JavaScript language were tools used to develop CIEON Inventory Management System website.",
      "background": "We cannot deny that the inventory management issue becomes one of the issues of numerous organizations that store valuable items. The tracking limitation system in organizations and missing items constitute a huge obstacle leading to the loss of cost in terms of replacing missing products. Some organizations waste expenses with ordering new items to replace the missing one, but sometimes they might find that particular item later. According to Gershon’s research in 2013 of 500 retail and service industry employees conducted by Kessler International, 95 percent of all businesses have encountered employee theft, and roughly 40 percent of employees have stolen from their employers. Employee Theft Statistics from the Statistic Brain Research Institute in 2018 found that 75% of employees admitted to stealing from their workplace at least once.",
      "objective": "CIEON Inventory Management System is a smart system incorporated to assist with inventory management systems by implementing a self-borrowing and a self-returning process. By gathering necessary data, such as item amount and status, the user who took the items, and the history of items and users, will help the owner to reduce the risk of missing and stolen items along with tracking users who took the items. The owner can follow the items and get more details about its status: borrow, return, lost, broken, and available. With the data from CIEON Inventory Management System website, the owner can recognize the current stock in the amount of available item, lost item, and broken item with a primary sign then fix it before returning it to be used in the system again. The owner can also look up the history of users who carried out some kind of process with the items via the online website. The implementation of CIEON Inventory Management System will benefit both employees and employers by deployment at the CIEON Inventory Management System process on the system website.",
      "linkYT": "https://youtu.be/yi9cMdbf_HU",
      "linkGit": "https://github.com/Jilaporn/CIEON-Inventory-Management-System",
      "Academic year": "2021",
      "img":""
    }
  ]
}
